---
kind: method
id: M:Autodesk.Revit.UI.ColorSelectionDialog.Show
zh: 取消隐藏、显示
source: html/8f9ca1fe-744c-924a-5e83-31e9d730065d.htm
---
# Autodesk.Revit.UI.ColorSelectionDialog.Show Method

**中文**: 取消隐藏、显示

Shows the Revit Color dialog as a modal dialog.

## Syntax (C#)
```csharp
public ItemSelectionDialogResult Show()
```

## Returns
A status indicating whether the user selected a color or cancelled the dialog without making a selection.